In [1]:
import pandas as pd
pd.__version__

'0.25.1'

In [2]:
dict_df = {
    "Student": ['A', 'B', 'C', 'D', 'E'],
     "Maths": [100, 98, 78, 89, 91],
    "Science": [67, 89, 66, 79, 90],
    "Arts": [89, 78, 67, 98, 76]
}

df = pd.DataFrame(dict_df)
df

  Student  Maths  Science  Arts
0       A    100       67    89
1       B     98       89    78
2       C     78       66    67
3       D     89       79    98
4       E     91       90    76

## Delete columns of a dataframe 

__[Reference: pandas drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)__

`axis = 1` : Columns of dataframe Â 
`axis = 0` : Rows of dataframe

In [3]:
df.drop(['Maths', 'Arts'], axis = 1)

  Student  Science
0       A       67
1       B       89
2       C       66
3       D       79
4       E       90

The same command can be written in the following ways using the parameter - `columns`.

In [4]:
df.drop(columns = ['Maths', 'Arts'])

  Student  Science
0       A       67
1       B       89
2       C       66
3       D       79
4       E       90

## Delete rows of a dataframe using the list of indices and `axis = 0`.

In [5]:
# Using index
df.drop([0,3], axis = 0)

  Student  Maths  Science  Arts
1       B     98       89    78
2       C     78       66    67
4       E     91       90    76

In [6]:
df.set_index('Student', inplace = True)
df

         Maths  Science  Arts
Student
A          100       67    89
B           98       89    78
C           78       66    67
D           89       79    98
E           91       90    76

In [7]:
df.drop(['B', 'D'], axis = 0)

         Maths  Science  Arts
Student
A          100       67    89
C           78       66    67
E           91       90    76